Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_1.tmx
Source language: de
Languages: en

source: Verbrennungsmotoren für Luftfahrzeuge
en: Combustion engines for aircraft

source: Verbrennungsmotoren für Maschinen
en: Combustion engines for machines

source: Turbolader für Fahrzeugmotoren
en: Turbo-superchargers for vehicle engines

source: Elektrische Poliermaschinen und -geräte
en: Machines and apparatus for polishing [electric]

source: Tragbare Bohrmaschinen [elektrisch]
en: Portable drilling machines [electric]

source: Kartoffelstampfer [elektrische Maschinen]
en: Potato mashers [electric machines]

source: Kartoffelschäler [elektrische Maschinen]
en: Potato peelers [electric machines]

source: Verbindungsketten für Antriebszwecke [ausgenommen für Landfahrzeuge]
en: Link chains for driving purposes [other than for land vehicles]

source: Rammen [Maschinen]
en: Rams [machines]

source: Schaufeln für Mähtraktoren
en: Front loaders for tractors

source: Zentrifugaltrennmaschinen für gewerbliche Zwecke
en: Centrifugal separating machines for industrial use

source: Wechselgetriebe [ausgenommen für Landfahrzeuge]
en: Change speed transmissions [other than for land vehicles]

source: Trennscheiben als Maschinenteile
en: Cutting discs for use as parts of machines

source: Schneideinsätze [Maschinenteile]
en: Cutting inserts [parts of machines]

source: Schneidwalzen [Maschinenteile]
en: Cutting rollers [parts of machines]

source: Schneidstreifen [Maschinenteile]
en: Cutting strips [parts of machines]

source: Drahtziehmaschinen für industrielle Zwecke
en: Manipulators [machines] for industrial use

source: Automatische Stempelmaschinen
en: Automatic stamping machines

source: Klotzbremsen [Maschinenteile, ausgenommen für Landfahrzeuge]
en: Block brakes [machine elements not for land vehicles]

source: Kugelringe für Werkzeugmaschinen
en: Ball rings for machine tools

source: Stellantriebe für Klappen
en: Actuators for dampers

source: Stellglieder mit einem Getriebe für Rohrleitungsventile
en: Actuators incorporating a gear mechanism for pipeline valves

source: Adapter für Rohre [Maschinenteile]
en: Adaptors for pipes [parts of machines]

source: Belüftungspumpen für Aquarien
en: Aerating pumps for aquaria

source: Roboter für gewerbliche Zwecke
en: Robots for use in industry

source: Roboter für Werkzeugmaschinen
en: Robots for machine tools

source: Steinbohrer [Maschinenteile]
en: Rock drills [parts of machines]

source: Drahtziehmatritzen als Maschinenteile
en: Wire drawing dies being parts of machines

source: Düngemittelverteiler [Maschinen]
en: Fertiliser spreaders [machines]

source: Meißel für Maschinen
en: Chisels for machines

source: Personenaufzüge für Gebäude
en: Passenger elevators for buildings

source: Abholzsägen [Maschinen]
en: Clearing saws [machines]

source: Kraftübertragungsriemen für Industriemaschinen
en: Power transmission belts for industrial machines

source: Kupplungen zur Kraftübertragung für Luftfahrzeuge
en: Power transmission couplings for aircraft

source: Rasenkantenschneider [Maschinen]
en: Lawn edge trimmers [machines]

source: Rasenmähmaschinenaufsätze für Fahrzeuge
en: Lawn mowing attachments for vehicles

source: Hebenmaschinen als Aufsätze für Landfahrzeuge
en: Lifting attachments for land vehicles

source: Setzpressen [Maschinen]
en: Setting presses [machines]

source: Wellen für Kugelhülsen
en: Shafts for ball bushings

source: Formschneider [Maschinen]
en: Shaper cutters [machines]

source: Kultivatoren [landwirtschaftliche Maschinen]
en: Incorporators [agricultural implements]

source: Luftreiniger [Luftfilter] für Motoren
en: Air cleaners [air filters] for engines

source: Töpferscheiben
en: Potters' wheels

source: Servomotoren für Nähmaschinen
en: Servo motors for sewing machines

source: Zündvorrichtungen für Motoren von Landfahrzeugen
en: Ignition devices for motors of land vehicles

source: Pneumatische Stellglieder für Steuerventile
en: Pneumatic actuators for control valves

source: Mechanische Übersetzungsgetriebe [ausgenommen für Landfahrzeuge]
en: Mechanical transmissions [other than for land vehicles]

source: Gefederte Metallblechführungen [Teile von Maschinen]
en: Sprung sheet metal guides [parts of machines]

source: Stirnrad-Seilwinden [Maschinenteile]
en: Spur wheel pulley blocks [parts of machines]

source: Landwirtschaftliche Spritzmaschinen
en: Agricultural spraying machines

source: Luftleitungen für Düsentriebwerke
en: Air ducting for jet engines

source: Feuchtwalzen als Maschinenteile
en: Damping rollers being parts of machines

source: Batteriebetriebene Spritzmaschinen
en: Battery operated spraying machines

source: Lagergehäuse
en: Bearing housings

source: Lötrohre [gasbetriebene Schneidemaschinen]
en: Blow pipes [gas-operated cutting apparatus]

source: Blasrohre als Teile von Brennschneidern
en: Blow pipes being parts of gas cutting apparatus

source: Blasrohre als Teile von Gasschweißgeräten
en: Blow pipes being parts of gas welding apparatus

source: Drehachsen [Maschinenteile]
en: Rotating centres [parts of machines]

source: Rotierende Förderschnecken
en: Rotating screw conveyors

source: Längsschneidemaschine für Kunststoffmaterialien
en: Longitudinal cutters for plastics materials

source: Maschinen zur Halbleiterplättchenbearbeitung
en: Semiconductor wafer processing equipment

source: Dieselmotoren [ausgenommen für Landfahrzeuge]
en: Diesel engines not for land vehicles

source: Zyklone
en: Cyclones

source: Antriebe für Vakuumpumpen
en: Drives for vacuum pumps

source: Kompressoren [Verdichter] für Abfallsammelbehälter
en: Compressors [compactors] for waste collection containers

source: Kompressoren für die Vorverdichtung von Verbrennungsmotoren
en: Compressors for supercharging internal combustion engines

source: Regler [Maschinenteile]
en: Regulators [parts of machines]

source: Kurbeln [Maschinenteile]
en: Cranks [parts of machines]

source: Messer für Mähbalken [Maschinenteile]
en: Cutter bar knives [parts for machines]

source: Mähbalken [Maschinenteile]
en: Cutter bars [parts of machines]

source: Scheidwerkzeuge als Teile von Maschinen
en: Cutting tools being parts of machines

source: Triebwerke für Fahrzeuge, ausgenommen für Landfahrzeuge
en: Propulsion mechanisms, other than for land vehicles

source: Schleifscheiben [Teile von Elektromaschinen]
en: Sharpening wheels [parts of electric machines]

source: Präzisionstrennwerkzeuge [Maschinen]
en: Precision parting tools [machines]

source: Halbleiterbearbeitungsmaschinen zur Herstellung von Halbleiterscheiben
en: Semiconductor processing machines for the manufacture of semiconductor wafers

source: Abscheidezylinder [Maschinenteile]
en: Separating cylinders [parts of machines]

source: Pneumatisch zu betätigende Ventile
en: Pneumatically operable valves

source: Numerisch gesteuerte Bearbeitungsstationen für Bohrarbeiten
en: Numerically controlled machining stations for drilling

source: Wellenkupplungen [Maschinenteile]
en: Shaft couplings as parts of machines

source: Speisevorrichtungen für Maschinenkessel
en: Feeding apparatus for engine boilers

source: Matrizen für Druckereizwecke
en: Matrices for use in printing

source: Druckmaschinen [für Textilien]
en: Printing machines [for textile]

source: Vakuumpolster für Vakuumpumpmaschinen
en: Vacuum pads for vacuum pump machines

source: Geräte zur Pulververarbeitung [Maschinen]
en: Powder handling apparatus [machines]

source: Melkmaschinen
en: Milking machines

source: Hebegeräte zum Handhaben von Lasten
en: Lifting gear for handling loads

source: Hebemaschinen für den Transport von Schüttgut
en: Lifting machines for transporting bulk materials

source: Flaschenzüge [Maschinen]
en: Lifting tackle [machines]

source: Linearmotoren, ausgenommen für Landfahrzeuge
en: Linear motors, other than for land vehicles

source: Käseschneider [Maschinen]
en: Cheese slicers [machines]

source: Meißelköpfe [Werkzeugmaschinen]
en: Chisel heads [machine tools]

source: Kupplungshebel, ausgenommen für Landfahrzeuge
en: Clutch levers, other than for land vehicles

source: Reinigungsmaschinen für Flugzeugtriebwerke
en: Cleaning machines for aviation engines

source: Schneidwerkzeuge [Maschinen] aus Sinterwerkstoffen auf Nitridbasis
en: Cutting tools [machine] made of sintered materials based on nitrides

source: Zylinderköpfe aus gegossenen Leichtmetalllegierungen [Maschinenteile]
en: Cylinder heads made of castings of light metal alloys [parts of machines]

source: Elektrische Teppichreinigungsgeräte
en: Carpet cleaning machines [electric]

source: Steuermechanismen für Getriebe
en: Transmission control mechanisms

source: Maschinen zur Herstellung von Wellpappe
en: Corrugated paperboard making machines

source: Schleifmaschinen mit Spiralkegelrädern
en: Grinding machines with spiral bevel gears

source: Emulgiermaschinen für chemische Verfahren
en: Emulsifying machines [for chemical processing]

source: Elektrische Reinigungsmaschinen und -geräte
en: Machines and apparatus for cleaning, electric

source: Ballenpressen für Abfälle [Maschinen]
en: Waste baling presses [machines]

source: Kompressoren als Teile von Maschinen, Motoren und Triebwerken
en: Compressors as parts of machines, motors and engines

source: Heckenschneider [Maschinen]
en: Hedge cutters [machines]

source: Hähne [Maschinen- oder Motorenteile]
en: Taps [parts of machines, engines or motors]

source: Elektrische Strickmaschinen
en: Electric knitting machines

source: Rotorarme für Zerkleinerungsmaschinen
en: Rotor arms for size reduction machines

source: Oberfräsen [Maschinen]
en: Routers [machines]

source: Laufflächen [Maschinenteile] für Verpackungsmaschinen
en: Rolling surfaces [parts of machines] for packages

source: Walzen für Walzmaschinen
en: Rolling mill cylinders

source: Elektrische Generatoren mit Solarzellen
en: Electrical generators using solar cells

source: Pflüge [traktorgezogene landwirtschaftliche Geräte]
en: Ploughs [tractor towed agricultural implements]

source: Pendelschutzbremsen für Greifzangen
en: Anti-swinging brakes for tongs

source: Küchenwerkzeuge [elektrische Geräte]
en: Kitchen tools [electric utensils]

source: Wringmaschinen für Wäsche
en: Wringing machines for laundry

source: Maschinen zum Polieren
en: Machines for burnishing

source: Halbautomatische Gehäuseklebemaschinen
en: Semi-automatic case gluing machines

source: Universalfräsmaschinen mit numerischer Positionierung
en: Numerically positioned universal milling machines

source: Mutternsprenger [Maschinen]
en: Nut splitters [machines]

source: Hydropneumatische Akkumulatoren
en: Hydro-pneumatic accumulators

source: Drehstromlichtmaschinen für Landfahrzeuge
en: Electric alternators for land vehicles

source: Baumsägen [elektrisch]
en: Pruning saws [electric]

source: Pneumatische Industriewerkzeuge
en: Industrial pneumatic tools

source: Bremsen für Pressen
en: Brakes for presses

source: Elektrische Nähmaschinen
en: Electric sewing machines

source: Elektrische Staubsauger zur industriellen Nutzung
en: Electric vacuum cleaners for industrial use

source: Insektizidzerstäuber [elektrische Handwerkzeuge]
en: Sprayers (insecticide -) [hand-held tools, electric]

source: Spritzgeräte [Maschinen] für die Landwirtschaft
en: Sprayers [machines] for use in agriculture

source: Schneidmaschinen für Sperrholz
en: Plywood clipping machines

source: Kupplungen für pneumatische Apparate
en: Couplings for pneumatic apparatus

source: Geräte für den Gartenbau [Maschinen]
en: Horticultural implements [machines]

source: Elektrische Kaffeemühlen
en: Power-operated coffee grinders

source: Bügelmaschinen für Textilwaren
en: Ironing machines for textile articles

source: Vierkantkeile [Getriebeteile von Wasserfahrzeugen]
en: Splines (square -) [parts of water vehicle gearing]

source: Getriebe für Fahrzeuge, ausgenommen für Landfahrzeuge
en: Step-up gears for vehicles [other than land vehicles]

source: Absperrventile aus Metall [Maschinenteile]
en: Stop valves of metal [parts of machines]

source: Steuerriemenspanner für Landfahrzeuge
en: Timing belt tensioners for land vehicles

source: Spitzen für Scheren [Maschinenteile]
en: Tips for cutters [parts of machines]

source: Mehrzweckspindelköpfe zum Bohren [Maschinenteile]
en: Multiple spindle heads for use in drilling [parts of machines]

source: Zangen [Maschinen]
en: Nippers [machines]

source: Automatische Förderanlagen
en: Automatic conveyor installations

source: Pumpen als Teile von Waschmaschinen
en: Pumps being parts of washing machines

source: Elektrische Waschmaschinen
en: Electric washing machines

source: Wäschewaschmaschinen [münzbetätigt]
en: Machines for washing clothing [coin-operated]

source: Hydraulische Hubtische
en: Hydraulic lift tables

source: Werkstückhalter für Poliermaschinen
en: Piece holders for polishing machines

source: Druckmaschinen für elektronische Vervielfältigungsprozesse
en: Printing machines for electronic duplicating processes

source: Auspufftöpfe für Wasserfahrzeuge
en: Exhaust mufflers for watercraft

source: Raketentriebwerke für Boote
en: Rocket propulsion engines for boats

source: Fahrbare Treppen [motorisiert]
en: Mobile stairs [motorised]

source: Mosaikdruckköpfe für Anschlagdruckmaschinen [ausgenommen für Bürozwecke]
en: Mosaic-type heads for impact printing machines [other than for office use]

source: Verpackungsgeräte [Maschinen]
en: Packaging apparatus [machines]

source: Ultraschallreinigungsgeräte für Schmuckwaren
en: Ultrasonic cleaning instruments for jewellery

source: Zylinder für Maschinen
en: Cylinders for machines

source: Schiebeventile [Maschinenteile]
en: Slide valves [parts of machines]

source: Geräte zum Ausbreiten von Erde [Maschinen]
en: Soil spreading apparatus [machines]

source: Lagerplatten zum Stützen von Wellenlagern
en: Sole plates for supporting shaft bearings

source: Schleifräder für elektrische Schleifmaschinen
en: Abrasive wheels for power-operated grinders

source: Antiblockiergeräte für Maschinen
en: Anti-lock brake apparatus for machines

source: Spritzgeräte [Maschinenteile], ausgenommen für medizinische Zwecke
en: Sprays [parts of machines], other than for medical use

source: Rakeln [Maschinenteile]
en: Squeegees [machines]

source: Steppmaschinen für die Herstellung von Polsterwaren
en: Quilting machines for use in the manufacture of upholstery

source: Elektrische Schweißmaschinen für Heizkörper
en: Radiator welding machines (Electric -)

source: Raspeln [Maschinen]
en: Rasps [machines]

source: Fixierer für Werkstücke [Maschinen]
en: Workpiece locators [machines]

source: Gleitschlitten für Werkstücke [Maschinenteile]
en: Workpiece slide tables [parts of machines]

source: Seilrollen mit Schrauben [Maschinenteile]
en: Screw pulley blocks [parts of machines]

source: Kraftbetätigte Schlauchhaspeln
en: Power-operated garden hose reels

source: Luftfilter für Kraftfahrzeugmotoren
en: Air filters for automobile engines

source: Nockenwellen
en: Cam shafts

source: Bohrstücke für Bohrmaschinen
en: Drilling tips for drilling machines

source: Düsen als Maschinenteile
en: Jets being parts of machines

source: Wippsägen [Maschinen]
en: Jig-saws [machines]

source: Elektrische Haushaltsmaschinen zum Staubsaugen
en: Electrical domestic machines for vacuuming

source: Kältemittelkompressoren für Heizungsanlagen
en: Refrigerant compressors for heating installations

source: Fahrbahnmarkierungsfahrzeuge [Maschinen]
en: Road marking vehicles [machines]

source: Rasen- und Gartentrimmerspulen
en: Lawn and garden string trimmer spools

source: Tauchfähige Elektromotoren [ausgenommen für Landfahrzeuge]
en: Submersible electric motors [other than for land vehicles]

source: Erdbohrer
en: Earth augers

source: Elektrohämmer [tragbar]
en: Electric hammers [hand-held]

source: Elektrische Teppichstaubsauger
en: Electric carpet vacuum cleaners

source: Maschinen zum Waschen von Golfbällen
en: Machines for washing golf balls

source: Elektrische Auftragsgeräte für Polstershampoo
en: Upholstery shampoo applicators (Electric -)

source: Numerisch gesteuerte Bohrmaschinen mit Koordinatentischen
en: Numerically controlled drilling machines with co-ordinate tables

source: Numerisch gesteuerte Werkzeugmaschinen
en: Numerically controlled machine tools

source: Pumpapparate [Maschinen]
en: Pumping apparatus [machines]

source: Schablonenschneider [Maschinen], ausgenommen für Bürozwecke
en: Stencil cutters [machines] other than for office use

source: Druckmaschinen zum Bedrucken von Verpackungen
en: Printing machines for printing on packaging

source: Maschinen zum Schokolieren von Nüssen
en: Machines for applying chocolate to nuts

source: Getriebeeinheiten, ausgenommen für Landfahrzeuge
en: Gear units, other than for land vehicles

source: Stumpfschweißgeräte für Draht [gasbetrieben]
en: Butt welding machines for wire [gas-operated]

source: Mähmaschinen [elektrisch]
en: Mowing machines [electric]

source: Schalldämpfer [Maschinenteile]
en: Mufflers [parts of machines]

source: Walzpressen [Maschinen]
en: Rolling presses [machines]

source: Walzen [Maschinenteile] für Verpackungsmaschinen
en: Rolling surfaces [machines] for packages

source: Ablassschrauben für Druckluft [Maschinenteile]
en: Discharge screws for compressed air [parts of machines]

source: Ablassschrauben für gasförmige Materialien [Maschinenteile]
en: Discharge screws for gaseous materials [parts of machines]

source: Schneidmühlen zur Montage an Sämaschinen
en: Gravity fed machines for mounting on sowing machines

source: Gelenkgetriebe für Wasserfahrzeuge
en: Artificial mist generating machines

source: Elektrische Schneebesen
en: Food whisks (Electric -)

source: Spritzdüsen als Maschinenteile
en: Spray nozzles being parts of machines

source: Triebwerke [Schiffsantriebsmaschinen]
en: Thrusters [marine propulsion apparatus]

source: Prägepressen [Maschinen]
en: Minting presses [machines]

source: Erdhobel [Maschinen oder Maschinenteile]
en: Graders [machines or parts of machines]

source: Trennringe für horizontale Gleitrollen
en: Break rings for horizontal casters

source: Rotierende Hydraulikmotoren [ausgenommen für Landfahrzeuge]
en: Rotary hydraulic motors [other than for land vehicles]

source: Stationäre Förderbänder
en: Fixed belt conveyors

source: Elektrische Maschinen zum Wachspolieren für gewerbliche Fertigungszwecke
en: Wax-polishing machines (Electric -) for industrial purposes manufacturing

source: Grabenbagger [Maschinen]
en: Back hoes [machines]

source: Maschinen zum Drucken von Mustern, ausgenommen für Bürozwecke
en: Patterning mechanisms [machines], other than for office use

source: Rahmen für Stickmaschinen
en: Tambours for embroidery machines

source: Zündkerzen für Motoren
en: Spark plugs for engines

source: Messerklingen für elektrische Messer
en: Knife blades for electric knives

source: Nockenwellen für Fahrzeugmotoren
en: Camshafts for vehicle engines

source: Gebläse als Teile von Förderanlagen
en: Conveying system equipment, namely, blowers

source: Hähne [Maschinenteile]
en: Taps [machine tools]

source: Fräser für Maschinen
en: Milling tools [machines]

source: Drehzahlregler für Maschinen und Motoren
en: Speed governors for machines, engines and motors

source: Bagger als selbstfahrende Maschinen
en: Excavators being self propelled machines

source: Spannratschen [Maschinen]
en: Tension ratchets [machines]

source: Spannstücke in Form von Maschinenteilen
en: Tensioning pieces being parts of machines

source: Thermische Kontaktschweißmaschinen
en: Thermal contact welding machines

source: Schweißbrenner [Maschinen]
en: Thermic torches [machines]

source: Zylinderköpfe für Motoren
en: Cylinder heads for engines

source: Getreidemühlen [Maschinen]
en: Grain mills [machines]

source: Automatische Draggen für die Schifffahrt
en: Automatic grapnels for marine purposes

source: Kämme als Maschinenteile
en: Combs being parts of machines

source: Turbinenwellen [Maschinenteile]
en: Turbine shafts [parts of machines]

source: Zwirnmaschinen in Form von Textilmaschinen
en: Twisting frames being textile machines

source: Kältemittelkompressoren für Kühlanlagen
en: Refrigerant compressors for cooling installations

source: Polykristalline Diamantschneider zum Zuschneiden von Werkstücken [Maschinen]
en: Polycrystalline diamond cutters for ready cutting of workpieces [machines]

source: Tragbare Elektrowerkzeuge
en: Portable electric power tools

source: Verbindungsmechanismen [Maschinenteile]
en: Linking mechanisms [parts of machines]

source: Einspritzdüsen für Motoren
en: Injectors for engines

source: Kardenbeschläge [Maschinenteile]
en: Card clothing [parts of carding machines]

source: Rahmen als Teile von hydraulischen Aufzügen
en: Frames being parts of hydraulic elevators

source: Schneidführungsschienen für elektrische Maschinen
en: Cutting guides for use with electric machines

source: Halter für Schneideinsätze [Maschinenteile]
en: Cutting insert holders [parts of machines]

source: Schneidwerkzeuge [Maschinen] in Form von Schaftfräsern
en: Cutting tools [machine] in the form of end mills

source: Seitenschneider [Maschinen]
en: Side cutters [machines]

source: Einzelblatt-Diffusionsübertragungsplatten [Maschinenteile]
en: Single sheet diffusion transfer plates [parts of machines]

source: Spannfutter [Maschinenteile]
en: Chucks [parts of machines]

source: Expansionstanks [Teile von Maschinen]
en: Expansion tanks [parts of machines]

source: Elektrische Handwerkzeuge als Antrieb für Grillgeräte
en: Hand implements (Electric -) for use in barbecue cooking

source: Elektrische verstellbare Schraubendreher
en: Adjustable screwdrivers (Electric -)

source: Belüftungspumpen für Gewässer
en: Aeration pumps for bodies of water

source: Kraftgetriebene Heftmaschinen
en: Power-operated staple guns

source: Drahtschneider [Maschinen]
en: Wire cutters [machines]

source: Drahtziehgriffe [Maschinenteile]
en: Wire pulling grips [machines]

source: Salatschleudern [Maschinen]
en: Salad drainers [machines]

source: Schleifbänder für Maschinen
en: Sanding belts for use with machines

source: Motorsägen
en: Power saws

source: Gasturbinentriebwerke für Luftfahrzeuge
en: Gas turbine engines for air vehicles

source: Getriebegehäuse, ausgenommen für Landfahrzeuge
en: Gear box casings, other than for land vehicles

source: Werkzeugmaschinen zum Schleifen
en: Machine tools for grinding

source: Werkzeugmaschinen als Bausätze
en: Machine tools for sale in kit form

source: Maschinen zur Montage von Halbleiterbauelementen
en: Machines for the assembly of semiconductor components

source: Flanschverbindungen für Rohre [Maschinenteile]
en: Clamp connectors for piping [parts of machines]

source: Klemmvorrichtungen für Werkzeugmaschinen
en: Clamping devices being parts of machine tools

source: Kraftübertragungsriemen für Meeresfahrzeuge
en: Power transmission belts for sea craft

source: Kraftübertragungskupplungen [ausgenommen für Landfahrzeuge]
en: Power transmission couplings [other than for land vehicles]

source: Kupplungen zur Kraftübertragung für Wasserfahrzeuge
en: Power transmission couplings for water vehicles

source: Hochdruckmaschinen [Druckmaschinen]
en: Letterpresses [printing machines]

source: Nivellierer [Maschinen]
en: Levellers [machines]

source: Erdhobel [Erdbewegungsmaschinen]
en: Graders [earth moving machines]

source: Elektrische Rührgeräte
en: Electric egg beaters

source: Elektrische Messerschärfer
en: Electric knife sharpeners

source: Wellenlager [Maschinenteile]
en: Shaft bearings [parts of machines]

source: Trogförderer [Maschinen]
en: Trough conveyors [machines]

source: Einsätze für Filtriermaschinen
en: Cartridges for filtering machines

source: Kompressoren für Kühlanlagen
en: Compressors for refrigerators

source: Schalldämpfer als Teile von Fahrzeugauspuffanlagen
en: Silencers as part of vehicle exhaust systems
